上午 = `管理学 周毕文 9.8、9.22、10.13、10.20、10.27、11.3、11.10 研究生楼（206）
会计学 王锐 11.2、11.9、11.16、11.23、11.30、12.7、12.28
管理统计学 李金林 9.8、9.22、10.13、10.20、10.27、11.3、11.10
运作管理 李果 11.24、12.1、12.8、12.15
能源经济学 廖华 9.8、9.22 研究生楼（304）
商务英语 祝迎新 9.7、9.21、9.28、10.19 `;

下午 = `物流与供应链管理 关磊 11.2、11.9、11.16、11.23、11.30、12.7、12.28 研究生楼（405）
管理者的领导艺术 钟惠波 11.2、11.9、11.16、11.23、11.30、12.7、12.28 研究生楼（407）
跨文化管理 孟凡臣 11.2、11.9、11.16、11.23、11.30、12.7、12.28 研究生楼（502）
企业经营决策沙盘模拟 王锐（一） 12.28 研究生楼（104）
中国特色社会主义理论与实践研究 卫志民 11.2、11.9、11.16、11.23、11.30、12.7、12.28、1.4
商业伦理与企业社会责任 孟凡臣 9.8、9.22、10.13、10.20、10.27、11.3、11.10
运作管理 李果 11.24、12.1、12.8
能源经济学 廖华 9.8、9.22 研究生楼（304）
商务英语 祝迎新 9.7、9.28、10.19 `;

晚上 = `财务分析与经营决策 孙利沿 10.21、10.28、11.4、11.11、11.18、11.25、12.2、12.9 信息楼（1004）
国际贸易理论与实务 彭红斌 9.10、9.17、9.24、10.8、10.15、10.22、10.29、11.5 研究生楼（505）
运筹学 赵先 9.11、9.18、9.25、10.9、10.16、10.23、10.30、11.6 研究生楼（208）
国际贸易理论与实务 张晓甦 9.12、9.19、9.26、10.10、10.17、10.24、10.31、11.7 研究生楼（606）
国际金融 刘岭 10.11、10.18、10.25、11.1、11.8、11.15、11.22、11.29 研究生楼（506）
创新与变革管理（一） 汪涛 9.16、9.23、9.30、10.14、10.21、10.28、11.4、11.11 研究生楼（104）
组织行为学（一） 王成全 9.10、9.17、9.24、10.8、10.15、10.22、10.29、11.5 研究生楼（607）
税收理论与实务 李昕 10.30、11.6、11.13、11.20、11.27、12.4、12.11、12.18 研究生楼（409）
国际商法 戚淳 9.12、9.19、9.26、10.10、10.17、10.24、10.31、11.7 研究生楼（605）
员工关系管理 邓剑伟 10.11、10.25、11.1、11.8、11.15、11.22、11.29、12.6 研究生楼（605）
创新与变革管理（二） 汪涛 11.18、11.25、12.2、12.9、12.16、12.23、12.30、1.6 研究生楼（104）
创业与家族企业管理 裴蓉 9.10、9.17、9.24、10.8、10.15、10.22、10.29、11.5 研究生楼（605）
组织行为学（二） 陈振娇 11.13、11.20、11.27、12.4、12.11、12.18、12.25、1.8 研究生楼（208）
投资学 刘胜 9.12、9.19、9.26、10.10、10.17、10.24、10.31、11.7 研究生楼（502）
能源经济学 廖华 9.6、9.20、9.22、9.27 研究生楼（304）
品牌管理 黄崇铭 9.9、9.16、9.23、9.30、10.14、10.21、10.28、11.4 信息楼 3008
能源系统生产率分析 王科 12.3、12.10、12.17、12.24 研究生楼（502）
员工关系管理 刘平青 9.11、9.18、9.25、10.9、10.16、10.23、10.30、11.6 研究生楼（405）
能源系统生产率分析 王科 12.5、12.12、12.19、12.26 研究生楼（502）
组织行为学（一） 陈振娇 11.11、11.18、11.25、12.2、12.9、12.16、12.23、12.30 研究生楼（507）
企业经营决策沙盘模拟 王锐（一） 12.28 研究生楼（104）
管理沟通 易瑾超 10.13、10.20、10.27、11.3、11.10、11.17、11.24、12.1 研究生楼（104）
经济学 余晓泓 11.2、11.9、11.16、11.23、11.30、12.7、12.28、1.4 研究生楼（605）
经济法 杨裕钦 9.8、9.22、10.13、10.20、10.27、11.3、11.10、11.17 研究生楼（207）
组织行为学（二） 王成全 11.2、11.9、11.16、11.23、11.30、12.7、12.28、1.4 研究生楼（607）
创业管理 王兆华 9.22、10.13、10.20、10.27、11.3、11.10、11.17、11.24 研究生楼（206）
中国特色社会主义理论与实践研究 卫志民 11.2、11.9、11.16、11.23、11.30、12.7、12.28、1.4、1.11`;

必修课 = [
    "会计学",
    "商务英语",
    "管理统计学",
    "运作管理",
    "中国特色社会主义理论与实践研究",
    "商业伦理与企业社会责任"
];

学分 = {
    会计学: 2,
    商务英语: 2,
    管理统计学: 2,
    运作管理: 2,
    中国特色社会主义理论与实践研究: 2,
    商业伦理与企业社会责任: 2,

    财务分析与经营决策: 2,
    国际贸易理论与实务: 2,
    运筹学: 2,
    国际金融: 2,
    创新与变革管理: 2,
    组织行为学: 2,
    税收理论与实务: 2,
    国际商法: 2,
    员工关系管理: 2,
    创业与家族企业管理: 2,
    投资学: 2,
    能源经济学: 2,
    品牌管理: 2,
    能源系统生产率分析: 2,
    企业经营决策沙盘模拟: 1,
    管理沟通: 2,
    经济学: 2,
    经济法: 2,
    创业管理: 2,
    物流与供应链管理: 2,
    管理者的领导艺术: 2,
    跨文化管理: 2,
    管理学: 2
};

function parse(data, time) {
    return data
        .split("\n")
        .map(i => i.split(" "))
        .map(i => {
            return {
                名称: i[0],
                老师: i[1],
                日期: i[2],
                教室: i[3]
            };
        })
        .map(i => {
            i.日期 = i.日期.split("、").map(j => {
                let [month, day] = j.split(".");
                let year = month > 3 ? "2019" : "2020";
                if (month < 10) month = "0" + month;
                if (day < 10) day = "0" + day;
                return `${year}-${month}-${day} ${time}`;
            });
            return i;
        });
}
let 全部课程 = [];

function add(data) {
    data.forEach(i => {
        for (let j = 0; j < 全部课程.length; j++) {
            if (全部课程[j].名称 == i.名称) {
                // console.log(i);
                全部课程[j].日期 = 全部课程[j].日期.concat(i.日期);
                return;
            }
        }
        全部课程.push(i);
    });
}
add(parse(上午, "上午"));
add(parse(下午, "下午"));
add(parse(晚上, "晚上"));

全部课程.sort((a, b) => (a.name > b.name ? 1 : -1));
console.log(全部课程);

window.aaa = 全部课程;
